Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128MU504.h
#define _CM3FLTR_CFSEL1_POSITION                 0x00000005
#define _CM3FLTR_CFSEL1_MASK                     0x00000020
#define _CM3FLTR_CFSEL1_LENGTH                   0x00000001

#define _CM3FLTR_CFSEL2_POSITION                 0x00000006
#define _CM3FLTR_CFSEL2_MASK                     0x00000040
#define _CM3FLTR_CFSEL2_LENGTH                   0x00000001

#define _CM4CON_CCH_POSITION                     0x00000000
#define _CM4CON_CCH_MASK                         0x00000003
#define _CM4CON_CCH_LENGTH                       0x00000002

#define _CM4CON_CREF_POSITION                    0x00000004
#define _CM4CON_CREF_MASK                        0x00000010
#define _CM4CON_CREF_LENGTH                      0x00000001

#define _CM4CON_EVPOL_POSITION                   0x00000006
#define _CM4CON_EVPOL_MASK                       0x000000C0
#define _CM4CON_EVPOL_LENGTH                     0x00000002

#define _CM4CON_COUT_POSITION                    0x00000008
#define _CM4CON_COUT_MASK                        0x00000100
#define _CM4CON_COUT_LENGTH                      0x00000001

#define _CM4CON_CEVT_POSITION                    0x00000009
#define _CM4CON_CEVT_MASK                        0x00000200
#define _CM4CON_CEVT_LENGTH                      0x00000001

#define _CM4CON_CPOL_POSITION                    0x0000000D
#define _CM4CON_CPOL_MASK                        0x00002000
#define _CM4CON_CPOL_LENGTH                      0x00000001

#define _CM4CON_COE_POSITION                     0x0000000E
#define _CM4CON_COE_MASK                         0x00004000
#define _CM4CON_COE_LENGTH                       0x00000001

#define _CM4CON_CON_POSITION                     0x0000000F
#define _CM4CON_CON_MASK                         0x00008000
#define _CM4CON_CON_LENGTH                       0x00000001

#define _CM4CON_CCH0_POSITION                    0x00000000
#define _CM4CON_CCH0_MASK                        0x00000001
#define _CM4CON_CCH0_LENGTH                      0x00000001

#define _CM4CON_CCH1_POSITION                    0x00000001
#define _CM4CON_CCH1_MASK                        0x00000002
#define _CM4CON_CCH1_LENGTH                      0x00000001

#define _CM4CON_EVPOL0_POSITION                  0x00000006
#define _CM4CON_EVPOL0_MASK                      0x00000040
#define _CM4CON_EVPOL0_LENGTH                    0x00000001

#define _CM4CON_EVPOL1_POSITION                  0x00000007
#define _CM4CON_EVPOL1_MASK                      0x00000080
#define _CM4CON_EVPOL1_LENGTH                    0x00000001

#define _CM4CON_CEN_POSITION                     0x0000000F
#define _CM4CON_CEN_MASK                         0x00008000
#define _CM4CON_CEN_LENGTH                       0x00000001

#define _CM4MSKSRC_SELSRCA_POSITION              0x00000000
#define _CM4MSKSRC_SELSRCA_MASK                  0x0000000F
#define _CM4MSKSRC_SELSRCA_LENGTH                0x00000004

#define _CM4MSKSRC_SELSRCB_POSITION              0x00000004
#define _CM4MSKSRC_SELSRCB_MASK                  0x000000F0
#define _CM4MSKSRC_SELSRCB_LENGTH                0x00000004

#define _CM4MSKSRC_SELSRCC_POSITION              0x00000008
#define _CM4MSKSRC_SELSRCC_MASK                  0x00000F00
#define _CM4MSKSRC_SELSRCC_LENGTH                0x00000004

#define _CM4MSKSRC_SELSRCA0_POSITION             0x00000000
#define _CM4MSKSRC_SELSRCA0_MASK                 0x00000001
#define _CM4MSKSRC_SELSRCA0_LENGTH               0x00000001

#define _CM4MSKSRC_SELSRCA1_POSITION             0x00000001
#define _CM4MSKSRC_SELSRCA1_MASK                 0x00000002
#define _CM4MSKSRC_SELSRCA1_LENGTH               0x00000001

#define _CM4MSKSRC_SELSRCA2_POSITION             0x00000002
#define _CM4MSKSRC_SELSRCA2_MASK                 0x00000004
#define _CM4MSKSRC_SELSRCA2_LENGTH               0x00000001

#define _CM4MSKSRC_SELSRCA3_POSITION             0x00000003
#define _CM4MSKSRC_SELSRCA3_MASK                 0x00000008
#define _CM4MSKSRC_SELSRCA3_LENGTH               0x00000001

#define _CM4MSKSRC_SELSRCB0_POSITION             0x00000004
#define _CM4MSKSRC_SELSRCB0_MASK                 0x00000010
#define _CM4MSKSRC_SELSRCB0_LENGTH               0x00000001

#define _CM4MSKSRC_SELSRCB1_POSITION             0x00000005
#define _CM4MSKSRC_SELSRCB1_MASK                 0x00000020
#define _CM4MSKSRC_SELSRCB1_LENGTH               0x00000001

#define _CM4MSKSRC_SELSRCB2_POSITION             0x00000006
#define _CM4MSKSRC_SELSRCB2_MASK                 0x00000040
#define _CM4MSKSRC_SELSRCB2_LENGTH               0x00000001

#define _CM4MSKSRC_SELSRCB3_POSITION             0x00000007
#define _CM4MSKSRC_SELSRCB3_MASK                 0x00000080
#define _CM4MSKSRC_SELSRCB3_LENGTH               0x00000001

#define _CM4MSKSRC_SELSRCC0_POSITION             0x00000008
#define _CM4MSKSRC_SELSRCC0_MASK                 0x00000100
#define _CM4MSKSRC_SELSRCC0_LENGTH               0x00000001

#define _CM4MSKSRC_SELSRCC1_POSITION             0x00000009
#define _CM4MSKSRC_SELSRCC1_MASK                 0x00000200
#define _CM4MSKSRC_SELSRCC1_LENGTH               0x00000001

#define _CM4MSKSRC_SELSRCC2_POSITION             0x0000000A
#define _CM4MSKSRC_SELSRCC2_MASK                 0x00000400
#define _CM4MSKSRC_SELSRCC2_LENGTH               0x00000001

#define _CM4MSKSRC_SELSRCC3_POSITION             0x0000000B
#define _CM4MSKSRC_SELSRCC3_MASK                 0x00000800
#define _CM4MSKSRC_SELSRCC3_LENGTH               0x00000001

#define _CM4MSKCON_AANEN_POSITION                0x00000000
#define _CM4MSKCON_AANEN_MASK                    0x00000001
#define _CM4MSKCON_AANEN_LENGTH                  0x00000001

#define _CM4MSKCON_AAEN_POSITION                 0x00000001
#define _CM4MSKCON_AAEN_MASK                     0x00000002
#define _CM4MSKCON_AAEN_LENGTH                   0x00000001

#define _CM4MSKCON_ABNEN_POSITION                0x00000002
#define _CM4MSKCON_ABNEN_MASK                    0x00000004
#define _CM4MSKCON_ABNEN_LENGTH                  0x00000001

#define _CM4MSKCON_ABEN_POSITION                 0x00000003
#define _CM4MSKCON_ABEN_MASK                     0x00000008
#define _CM4MSKCON_ABEN_LENGTH                   0x00000001

